<template>
    <div id="exemption">
        <div class="rules">
            <h5>汇嗨购服务协议</h5>
            <p>
                欢迎申请使用xx科技有限公司（以下简称“本公司”）提供的汇嗨购有奖平台服务（“汇嗨购”指用户使用微信或支付宝支付一、三、五元购买对应金币，即可参与汇嗨购活动），请您（下列简称为“用户”）仔细阅读以下内容。如用户不同意本服务条款任意内容，请勿继续使用汇嗨购。如用户通过扫码进入点击汇嗨购并勾选“我已阅读并同意《服务协议》”，即表示用户与本公司已达成协议，自愿接受本服务条款的所有内容。此后，用户不得以未阅读本服务条款内容作任何形式的抗辩。</p>
            <p> 一、用户使用汇嗨购的前提条件 </p>
            <p>1、用户通过扫描售货机屏幕或者机身的二维码，微信或支付宝支付一、三、五元购买对应金币后获得参与汇嗨购活动资格。</p>
            <p>2、用户在使用汇嗨购时须具备相应的权利能力和行为能力，能够独立承担法律责任，如果用户在18周岁以下，必须在父母或监护人的监护下使用。</p>
            <p>二、用户管理</p>
            <p>1、用户ID 用户扫码进入后，经过第三方授权登录（微信或支付宝）汇嗨购时，本公司会为每位用户生成一个帐户ID，作为其使用汇嗨购服务的唯一身份标识，用户需对其帐户项下的所有行为负责。</p>
            <p>2、用户资料 用户在使用汇嗨购时个人资料均来源于微信或支付宝，用户资料包括但不限于个人用户头像、昵称、性别等信息。
                若用户帐号ID或帐号头像、昵称等资料存在违法信息的，本公司有权采取暂停使用等措施。</p>
            <p>3、用户应当保证在使用汇嗨购的过程中遵守诚实信用原则，不扰乱汇嗨购的正常秩序，不得通过使用他人帐户、一人使用多个帐户、使用程序自动处理等非法方式损害他人或本公司的利益。 </p>
            <p>4、若用户存在任何违法或违反本服务协议约定的行为，本公司有权视用户的违法或违规情况适用以下一项或多项处罚措施：</p>
            <p>（1）责令用户改正违法或违规行为； </p>
            <p>（2）中止、终止部分或全部服务；</p>
            <p>（3）取消用户汇嗨购资格；</p>
            <p>（4）符合法律法规规定的情况下，本公司认为合适的其他措施。 若用户的行为造成本公司及其关联公司损失的，用户还应承担赔偿责任。</p>
            <p> 三、汇嗨购的规则</p>
            <p>1、释义 用户需选择购买商品后支付一、三、五元购买对应金币后直接参与活动，结果由系统随机产生，存在质疑者请勿参与！</p>
            <p>2、本公司承诺遵循公平、公正、公开的原则运营汇嗨购，确保所有用户在汇嗨购中享受同等的权利与义务。 </p>
            <p>3、用户知悉，除本协议另有约定外，无论是否获得商品，用户用于参与汇嗨购的金额不能退回；其完全了解参与汇嗨购活动的存在风险，本公司不保证用户参与汇嗨购一定会获得商品。</p>
            <p>4、用户通过参与汇嗨购获得的商品，如有质量问题，请致电联系客服。</p>
            <p>5、如果下列情形发生，本公司有权取消用户在嗨购大咖相关服务：</p>
            <p>（1）因不可抗力，本系统发生故障或遭受第三方攻击，或发生其他本公司无法控制的情形；</p>
            <p>（2）根据本公司已经发布的或将来可能发布或更新的各类规则和规定取消的。</p>
            <p>四、本服务协议的修改 </p>
            <p>
                用户知晓本公司不时公布或修改的与本服务协议有关的规则、条款及公告是本服务协议的组成部分。本公司有权在必要时通过在汇嗨购内发出公告等合理方式修改本服务协议，用户在享受各项服务时，应及时查阅了解修改的内容，并自觉遵守本服务协议。用户如继续使用本服务协议涉及的服务，则视为对修改内容的同意，如发生争议，以最新的服务协议为准；用户在不同意修改内容的情况下，有权停止使用本服务协议涉及的服务。
                如用户对本规则内容有任何疑问，可拨打客服电话（400-762-3323）。</p>
        </div>
    </div>
</template>

<script>
    export default {
        name: "exemption"
    }
</script>

<style scoped lang="less">
    //用户条例
    .rules {
        width: 100%;
        height: 100%;
        background: white;
        position: fixed;
        top: 0;
        padding: 0 20px;
        box-sizing: border-box;
        overflow: scroll;
        padding-bottom: 30px;
        h5 {
            text-align: center;
            padding: 20px 0;
            font-size: 36px;
            font-weight: 700;
        }
        p {
            font-size: 32px;
            line-height: 50px;
        }
        .agree {
            color: #60A6EC;
            font-size: 32px;
            text-align: right;
        }
    }
</style>